mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Tarea3_TallerV_MABG.c
/**
 ******************************************************************************
 * @file           : Tarea3_TallerV_MABG.c
 * @author         : Miguel A. Bedoya Gonzalez --> mibedoyag@unal.edu.co
 * @brief          : Tarea 3 - LED RGB con señales PWM dirigidas por Encoder, Pot. (ADC) y USART
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 *
 *** Mapeo de Pines:
 ** PWM TIM1 - AF01:
 *
 * - CH1 (Green) -> PA8
 * - CH2 (Blue)  -> PA9
 * - CH3 (Red)   -> PA10
 *
 ** ENCODER TIM2 - AF01:
 * - CH1 (encoder: CLK) -> PA0
 * - CH2 (Encoder_ DT)  -> PA1
 *
 ** ADC TIM3 (TRGO):
 * - ADC -> PA6
 *
 ** BLINKY TIM4 -> PH1
 *
 ** USART2 - AF01:
 * - Tx -> PA2
 * - Rx -> PA3
 *
 ** MCO2 - AF00 -> PC9
 *
 ** Parámetros de Configuración para Terminal Serial:
 * - Baudrate : 19200
 * - Bits de Datos : 8 --\
 * - Paridad : No      -- |--> 8N1
 * - Bit de Parada : 1 --/
 *
 ** Caracteres de Recepción o Envío desde la Terminal Serial:
 * - '+' : Incrementa en 1% el Duty Cycle pwm_blue (CH2).
 * - '-' : Disminuye en 1% el Duty Cycle pwm_blue (CH2).
 * - '0' : Lleva al 0% el Duty Cycle pwm_blue (CH2).
 * - '5' : Lleva al 50% del Duty Cycle pwm_blue (CH2).
 *
 ******************************************************************************
 */

#include "stm32f4xx_hal.h"
#include "stdio.h"
#include "string.h"
#include "stdlib.h"

/* TIM1 handle — must be global so stm32f4xx_it.c can access it */
TIM_HandleTypeDef htim1;

/* TIM2 handle — must be global so stm32f4xx_it.c can access it */
TIM_HandleTypeDef htim2;

/* TIM3 handle — must be global so stm32f4xx_it.c can access it */
TIM_HandleTypeDef htim3;

/* TIM4 handle — must be global so stm32f4xx_it.c can access it */
TIM_HandleTypeDef htim4;

/* ADC1 handle — must be global so stm32f4xx_it.c can access it */
ADC_HandleTypeDef hadc1 = {0};

/* USART2 handle — must be global so stm32f4xx_it.c can access it */
UART_HandleTypeDef huart2 = {0};

uint8_t msg_buffer[256] = {0}; //Arerglo donde estará el mensaje dinámico a transmitir USART2 Tx - max 256 caracteres
uint8_t startupMsg[] =
"\r\n"
"========================================\r\n"
" Tarea 3 - Taller V\r\n"
"========================================\r\n"
"Comandos UART:\r\n"
"  + : Incrementa 1 click\r\n"
"  - : Decrementa 1 click\r\n"
"  0 : Reinicia el contador a 0 clicks \r\n"
"  5 : Incrementa 50 clicks\r\n"
"========================================\r\n\r\n"; //Mensaje Inicial del UART Tx


volatile uint8_t adc_chaged = 0; //Variable volatil que cambia cuando hay un cambio en el valor de ADC para pasar a hacer Tx
volatile uint16_t raw_adc = 0; //Variable volatil donde se almacena el valor de la conversión ADC
volatile uint8_t adc_done = 0; //Variable volatil que se modifica y lleva a la ejecución del Callback del ADC
float adc_value_mv = 0.0f; //Variable donde se guarda y convierte el valor en mV a partir del raw_adc ADC
uint16_t adc_old = 0; //Varibale con la que se compara el valor del ADC para así saber si se debe transmitir Tx dado el cambio

volatile uint8_t encoder_changed = 0; //Variable volatil que cambia cuando hay un cambio en el valor del encoder para pasar a hacer Tx
volatile int16_t encoder_steps = 0; //Variable dedicada a almacenar los pasos dados y actuales del encoder -> CW ++ y CCW --
volatile uint8_t encoder_dir = 0; //Variable que indicará la dirección del encoder (0 = CW, 1 = CCW)
char *dir_string = 0; //Variable tipo string (caracter) que indica CW si es 0 y CCW si es 1 para enviar en Tx USART2
uint16_t encoder_old = 0; //Varibale con la que se compara el valor del encoder para así saber si se debe transmitir Tx dado el cambio

uint8_t usart_clicks = 0; //Variable dondé estará el número actual de click de acuerdo al comando que reciba de la consola (Rx)
uint8_t rx_data = 0; //Variable donde se almacena el caracter recibido de la consola para su interpretación
volatile uint8_t usart_done = 0; //Variable volatil que se modifica y lleva a la ejecución de la lógica del callback por fuera
volatile uint8_t uart_changed = 0; //Variable volatil que cambia cuando hay una recepción Rx que modifique el PWM para pasar a hacer Tx

volatile uint16_t pwm_red = 0; //Variable que tendra el duty del PWM CH1 (PA8)
volatile uint16_t pwm_green = 0; //Variable que tendra el duty del PWM CH2 (PA9)
volatile uint16_t pwm_blue = 0; //Variable que tendra el duty del PWM CH3 (PA10)

//FSM ejecución while
typedef enum
{
	STATE_READ_ENCODER = 0,
	STATE_PROCESS_ADC,
	STATE_PROCESS_USART,
	STATE_SEND_MESSAGE
} AppState_t;

AppState_t currentState = STATE_READ_ENCODER; //Al iniciar, siempre estará iniciandose la lectura del encoder para actualizarse

/* Private function prototypes */
static void SystemClock_Config(void);
static void gpio_Init(void); //Función que inicializa y configura el puerto PH1 del blinky
static void tim1_pwm_Init(void); //Función asociada a la inicialización y configuración del TIM1 (PWM -> CH1, CH2, CH3)
static void tim2_encoder_Init(void); //Función asociada a la inicialización y configuración del TIM2 (Encoder -> CH1 (PA0), CH2 (PA1))
static void tim4_Init(void); //Función asociada a la inicialización y configuración del TIM4(Blinky)
static void tim3_adc_Init(void); //Función asociada a la inicialización y configuración del TIM3 (Disparo del ADC con TRGO (PA6))
static void usart2_Init(void); //Función asociada a la inicialización y configuración del USART2 (Rx, Tx)
static void adc_Init(void); //Función asociada a la inicialización y configuración del ADC (PA6 ADC1_CH6)
static void mco2_Init(void); //Función asociada a la configuración del PC9 para el MCO2 con lectura del clock 16 MHz

int main(void)
{
    HAL_Init();           /* initialize HAL: SysTick, cache, priority grouping */
    SystemClock_Config(); /* configure clock tree: HSI at 16 MHz               */
    gpio_Init();          /* configure PH1 as push-pull output                  */
    tim4_Init();          /* configure TIM4: update event every 250 ms          */

