mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Tarea3_TallerV_MABG.c
    usart2_Init();
    adc_Init();
    tim1_pwm_Init();
    tim2_encoder_Init();
    tim3_adc_Init();
    mco2_Init ();


    HAL_UART_Transmit(&huart2, (uint8_t *)startupMsg,strlen((char *)startupMsg), 500);  //Mensaje Inicial de Funcionamiento de la Recepción Rx via Tx

    while (1)
    {
    	switch(currentState){

    	case STATE_READ_ENCODER:
    		encoder_steps = __HAL_TIM_GET_COUNTER(&htim2) / 4; //Leyendo el valor del contador del TIM2 que maneja el encoder, se divide entre 4 ya que el modo TI12 cuenta todos los flancos (4 por paso de ambos canales 2 por canal (asc y desc)
    		pwm_red = encoder_steps * 5; //Ya que el encoder va de 0 a 100 y el periodo de la señal PWM es del 500 us, se hace la conversión para que el duty vaya de 0 a 500 aproximadamente

    		if (encoder_steps != encoder_old){
    			encoder_old = encoder_steps; //Se igualan para que encoder_old vaya tenieno el valor actual del encoder
    			encoder_changed = 1; //Si hay un cambio en el valor del encoder cambia la bandera para actulizar Tx
    		}

    		if (pwm_red > 499) {
				pwm_red = 499;
			}
    		__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, pwm_red); //Asignando el nuevo CCR que tiene pwm_red al Canal 3

    		if (__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim2)) { //Leyendo la dirección y asignando el valor en encoder_dir y dir_string para enviar por Tx USART2
				encoder_dir = 1;
				dir_string = "CCW";
			} else {
				encoder_dir = 0;
				dir_string = "CW";
			}

    		currentState = STATE_PROCESS_ADC;

    		break;

    	case STATE_PROCESS_ADC:
			if (adc_done == 1) {
				adc_value_mv = (float) ((3300.0f / 4095.0f) * raw_adc); //Transformando el valor raw adc en un valor de mV
				pwm_green = (raw_adc * 499) / 4095; //Realizando la conversión del raw_adc en duty para el pwm_green

				__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_1, pwm_green); //Asignando el valor del duty (CCR) del pwm_green al PWM del Canal 1.

				if (abs(raw_adc - adc_old) > 50){  //Se compara la diferencia para evitar salto por ruido que disparen la transmision
					adc_old = raw_adc;  //Se igualan ambos valores para que adc_old se pueda seguir comparando
					adc_chaged = 1; //Si hay un cambio significativo en el valor del adc, cambia la bandera para actualizar Tx
				}

				adc_done = 0; //Limpiando la bandera para que vuelva a entrar
			}

			currentState = STATE_PROCESS_USART;

			break;

    	case STATE_PROCESS_USART:
			if (usart_done == 1) {
				if (rx_data == '+') { //Identificando el carater "+" para que incremente usart_clicks en 1
					if (usart_clicks < 100) {
						usart_clicks++;
					}
				}

				if (rx_data == '-') { //Identificando el carater "-" para que disminuya usart_clicks en 1
					if (usart_clicks > 0) {
						usart_clicks--;
					}
				}

				if (rx_data == '0') { //Identificando el carater "0" para que lleve la variable usart_clicks a 0
					usart_clicks = 0;
				}

				if (rx_data == '5') { //Identificando el carater "5" para que incremente usart_clicks en 50
					usart_clicks += 50;

					if (usart_clicks >= 100) {
						usart_clicks = 100;
					}
				}

				pwm_blue = usart_clicks * 5; //Ya que usart_clicks va de 0 a 100 y el periodo de la señal PWM es del 500 us, se hace la conversión para que el duty vaya de 0 a 500 aproximadamente
				__HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_2, pwm_blue); //Asignando el valor de PWM del canal 2 que está en pwm_blue (CCR)
				HAL_UART_Receive_IT(&huart2, &rx_data, 1); //Se vuelve a activar la recepcion de datos ya que cuando recibe algo esta se desactiva y toca volverla a ejercutarla para que espere un nuevo comando


				uart_changed = 1; //Si hay un cambio en el valor del clicks recibidos por Rx, cambia la bandera para actualizar Tx
				usart_done = 0; //Limpiando la bandera para que vuelva a entrar
			}

			currentState = STATE_SEND_MESSAGE;

			break;

    	case STATE_SEND_MESSAGE:
			if (encoder_changed || adc_chaged || uart_changed) {  //Si hay algún cambio en alguna de estas variables, se ejecuta el if
				sprintf((char*) msg_buffer,
						"ADC value = %u raw\n\r" "ADC value = %.0f mV\n\r" "Encoder dir: %s, value = %d\n\r" "UART value = %u clicks\n\r\n\r\n\r",
						raw_adc, adc_value_mv, dir_string, encoder_steps,
						usart_clicks);
				HAL_UART_Transmit(&huart2, msg_buffer,
						strlen((char*) msg_buffer) - 1, 100);
				encoder_changed = 0;  //Vuelve la bandera a 0 para esperar si se produce otro cambio para transmitir
				adc_chaged = 0;  //Vuelve la bandera a 0 para esperar si se produce otro cambio para transmitir
				uart_changed = 0;  //Vuelve la bandera a 0 para esperar si se produce otro cambio para transmitir
			}

			currentState = STATE_READ_ENCODER; //Reinia la FSM para que se mantenda en bucle ejecutandose un caso tras el otro

			break;
    	}


    }
}

/*
 * SystemClock_Config
 * Uses HSI internal oscillator at 16 MHz
 * No PLL — simplest possible clock configuration
 */
static void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    /* HSI is already on at reset — confirm and use it */
    RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState            = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_NONE; //Desactiva el PLL, si se quiere llevar el MCU a la máxima freq. debe activarse (RCC_PLL_ON;) y luego se debe configurar los divisores y el multiplicador para llegar a la freq. final

    /* Si se quiere configurar el PLL, primero se debe elegir la fuente que tomará el PLL para la conversión, este caso
     * sería HSI, a continuación se configura el primer divisor (PLLM) (Ejm para 100 MHz: PLLM = 16 -> 16MHz / 16 = 1MHz),
     * luego de este iría el multiplicador (PLLN) (PLLN = 400 -> 1MHz * 400 = 400 MHz), se sigue entonces con el siguiente
     * y último divisor para el PLLCLK (PLLP) (RCC_PLLP_DIV4 = 4 -> 400MHz / 4 = 100 MHz y este será el PLLCLK. Hay un
     * divisor más (PLLQ) que no afecta el CPU como tal si no para el USB o el SDIO por ejemplo (PLLQ = 7 ->
     * 400 MHz / 7 = 57 MHz)*/

    HAL_RCC_OscConfig(&RCC_OscInitStruct); //Cargano la configuración en los registros FSR del MCU

    /* Select HSI as SYSCLK — all bus dividers set to 1 */
    RCC_ClkInitStruct.ClockType      = RCC_CLOCKTYPE_SYSCLK | //Todos estos relojes tendrán esta configuracion, reloj principal SYSCLK
                                       RCC_CLOCKTYPE_HCLK   | //reloj AHB HCLK
                                       RCC_CLOCKTYPE_PCLK1  | //reloj APB1 PCLK1
                                       RCC_CLOCKTYPE_PCLK2;   //reloj APB2 PCLK2
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_HSI;  // EL reloj principal del sistema (SYSCLK) utilizará como fuente el HSI (Internal), PLLCLK si se usará PLL
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;   /* HCLK  = 16 MHz */ //Si se utiliza PLL se debe tener en cuenta está división de acuerdo a lo máximo que soporta el BUS
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;     /* APB1  = 16 MHz */ //Si se utiliza PLL se debe tener en cuenta está división de acuerdo a lo máximo que soporta el BUS
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;     /* APB2  = 16 MHz */ //Si se utiliza PLL se debe tener en cuenta está división de acuerdo a lo máximo que soporta el BUS

    /* FLASH_LATENCY_0 = zero wait states, correct for 16 MHz */ //Para  100 MHz, por ejemplo, se debe agregar ciclos de espera ya que la Flash no puede ir tan rapido como el CLK (3 ciclos -> Tabla 5 Manual de Referencia, CAP 3)
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0);
}

