mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Tarea3_TallerV_MABG.c
/*
 * gpio_Init
 * Configures PH1 as push-pull output — onboard LED on Nucleo board (PH1 tactic board)
 */
static void gpio_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Enable GPIOA clock on AHB1 bus
       Same as bare-metal: RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN */
    __HAL_RCC_GPIOH_CLK_ENABLE();

    /* Configure PH1 */
    GPIO_InitStruct.Pin   = GPIO_PIN_1;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    HAL_GPIO_Init(GPIOH, &GPIO_InitStruct); //Cargamos la configuracion en los registros FSR del MCU
    __NOP();
}


/* Configuración del TIM1 y los 3 Canales de las 3 señales PWM (f = 2kHz) */
static void tim1_pwm_Init(void){

	__HAL_RCC_GPIOA_CLK_ENABLE(); //HAbilitando la señal de reloj del GPIOA (AHB1)

	/* Configuración inicial de los GPIO */
	//Configurando el GPIO PA8, PA9, PA10 para el CH1, CH2, CH3 respectivamente
	GPIO_InitTypeDef GPIO_Init_chtim1 = {0};

	GPIO_Init_chtim1.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10;
	GPIO_Init_chtim1.Mode = GPIO_MODE_AF_PP; //Modo funcion alternativa
	GPIO_Init_chtim1.Pull = GPIO_NOPULL; //No Pull Up ni Pull Down, los niveles altos y bajos serán controlados por el timer
	GPIO_Init_chtim1.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_Init_chtim1.Alternate = GPIO_AF1_TIM1; //Funcion alternativa AF01 del TIM1

	//Cargando la configuración en los registros FSR del MCU
	HAL_GPIO_Init(GPIOA, &GPIO_Init_chtim1);

	/* Configuración del TIMER 1 Base */
	__HAL_RCC_TIM1_CLK_ENABLE(); //Habilitando la señal de reloj del TIM1 (APB2)

	htim1.Instance = TIM1;
	htim1.Init.Prescaler = 15; //Preescaler a 16 MHz / 16 =  1 MHz -> 1 us
	htim1.Init.CounterMode = TIM_COUNTERMODE_UP; //Contador de manera ascendente
	htim1.Init.Period = 499; //500 us de periodo, lo que da una frecuencia de 2 kHz para cada canal PWM del TIM1
	htim1.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; //NO se hace un división adicional del reloj
	htim1.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

	//Cargando la configuración en los registros FSR del MCU
	HAL_TIM_PWM_Init(&htim1);

	//COnfiguración especifica de los Canales CH1, CH2 y CH3 del tim1
	TIM_OC_InitTypeDef ConfigOC_ch =  {0}; //Estructura Output Compare que configura como funciona cada canal

	ConfigOC_ch.OCMode = TIM_OCMODE_PWM1; //PWM Modo 1: Mientras CNT < CCR la salida está en alto, cuando CNT >= CCR la señal pasa a bajo (CCR (Capture/Compare Register) define el duty)
	ConfigOC_ch.Pulse = 0; //CCR inicia en 0 (Duty 0%) -> Led inicia apagado
	ConfigOC_ch.OCPolarity = TIM_OCPOLARITY_HIGH; //En alto el Led estará encendido, al contrario se invierte la logica de las salidas no complementarias (CH1, CH2 y CH3).
	ConfigOC_ch.OCFastMode = TIM_OCFAST_DISABLE; //Espera a terminar un ciclo para cambiar el duty y que no genere deformaciones en el pulso si se cambia al duty a mitad de un ciclo del pwm

	//Cargando la configuración en los registros FSR del MCU para cada Canal
	HAL_TIM_PWM_ConfigChannel (&htim1, &ConfigOC_ch, TIM_CHANNEL_1);
	HAL_TIM_PWM_ConfigChannel (&htim1, &ConfigOC_ch, TIM_CHANNEL_2);
	HAL_TIM_PWM_ConfigChannel (&htim1, &ConfigOC_ch, TIM_CHANNEL_3);

	//Iniciando o arrancando las señales en cada canal
	HAL_TIM_PWM_Start (&htim1, TIM_CHANNEL_1);
	HAL_TIM_PWM_Start (&htim1, TIM_CHANNEL_2);
	HAL_TIM_PWM_Start (&htim1, TIM_CHANNEL_3);


}

/* Configuración del TIM2 (32 bit) y los 2 Canales de las 2 entradas DT y CLK del encoder */
static void tim2_encoder_Init(void){
	__HAL_RCC_GPIOA_CLK_ENABLE(); //HAbilitando la señal de reloj del GPIOA (AHB1)

	/* Configuración inicial de los GPIO */
	//Configurando los pines del GPIO PA0 y  PA1 para el CH1 y CH2 respectivamente del TIM2
	GPIO_InitTypeDef GPIO_Init_chtim2 = { 0 };

	GPIO_Init_chtim2.Pin = GPIO_PIN_0 | GPIO_PIN_1; // Seleccion de GPIOA a usar
	GPIO_Init_chtim2.Mode = GPIO_MODE_AF_PP; //Indicando que funcionaran en modo ALternative Function
	GPIO_Init_chtim2.Pull = GPIO_PULLUP; //Asignando resistencia PullUp (nivel alto) para que los pines no queden sin definir o abiertos
	GPIO_Init_chtim2.Speed = GPIO_SPEED_FREQ_HIGH;
	GPIO_Init_chtim2.Alternate = GPIO_AF1_TIM2; //Funcion Alternatica AF01 del TIM2

	//Cargando la configuración en los registros FSR del MCU
	HAL_GPIO_Init(GPIOA, &GPIO_Init_chtim2);

	/* COnfiguración del TIMER 2 Base */
	__HAL_RCC_TIM2_CLK_ENABLE(); //Habilitando la señal de reloj del TIM2 (APB1)

	TIM_Encoder_InitTypeDef Config_encmode = {0};

	htim2.Instance = TIM2;
	htim2.Init.Prescaler = 0; //No dividirá los pulsos que reciba del encoder
	htim2.Init.CounterMode = TIM_COUNTERMODE_UP; //El modo encoder es quien decide hacia donde contar de acuerdo a lo que identifique (CW o CCW)
	htim2.Init.Period = 65535; //Contará hasta el maximo de la variable que es 16 bit (65535) y luego se desborda de nuevo a 0
	htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	htim2.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
	Config_encmode.EncoderMode = TIM_ENCODERMODE_TI12; // Modo encoder para usar ambos canales (CH1 y CH2) para determinar la dir y los steps (Por ello se registran 4 pasos por ciclo)


	//COnfiguración especifica de los Canales CH1
	Config_encmode.IC1Polarity = TIM_INPUTCHANNELPOLARITY_RISING; //Polaridad de entrada con flanco de subida para contar
	Config_encmode.IC1Selection = TIM_ICSELECTION_DIRECTTI; //Canal 1 leerá y estará conectado al Pin PA0 respectivo del TIM2 para CH1
	Config_encmode.IC1Prescaler = TIM_ICPSC_DIV1; //Se reliza captura cada que se detecta un flanco en la señal de entrada del CH1 sin division, todos los flancos
	Config_encmode.IC1Filter = 30; //Filtro donde deben pasar 30 ciclos para aceptar el cambio de señal para evitar rebotes.

	//COnfiguración especifica de los Canales CH2
	Config_encmode.IC2Polarity = TIM_INPUTCHANNELPOLARITY_RISING; //Polaridad de entrada con flanco de subida para contar
	Config_encmode.IC2Selection = TIM_ICSELECTION_DIRECTTI; //Canal 2 leerá y estará conectado al Pin PA1 respectivo del TIM2 para CH2
	Config_encmode.IC2Prescaler = TIM_ICPSC_DIV1; //Se reliza captura cada que se detecta un flanco en la señal de entrada del CH2 sin division, todos los flancos
	Config_encmode.IC2Filter = 30; //Filtro donde deben pasar 30 ciclos para aceptar el cambio de señal para evitar rebotes.

	//Cargando la configuración en los registros FSR del MCU
	HAL_TIM_Encoder_Init(&htim2, &Config_encmode);

	//Iniciando o arrancando los contadores con las señales (CEN = 1)
	HAL_TIM_Encoder_Start(&htim2, TIM_CHANNEL_ALL);


