mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Tarea3_TallerV_MABG.c
}
//USART2 init configuracion
//19200 8N1
static void usart2_Init(void){

	/* Enable GPIOA clock on AHB1 bus */
	 __HAL_RCC_GPIOA_CLK_ENABLE();

	 GPIO_InitTypeDef GPIO_Init_Tx_Rx = {0};

	 GPIO_Init_Tx_Rx.Pin = GPIO_PIN_2 | GPIO_PIN_3; //Pin PA2 (Tx) y PA3 (Rx)
	 GPIO_Init_Tx_Rx.Mode = GPIO_MODE_AF_PP;
	 GPIO_Init_Tx_Rx.Pull = GPIO_NOPULL;
	 GPIO_Init_Tx_Rx.Speed = GPIO_SPEED_FREQ_HIGH;
	 GPIO_Init_Tx_Rx.Alternate = GPIO_AF7_USART2;


	 //Cargar la configuracion en los registros FSR del MCU
	 HAL_GPIO_Init(GPIOA, &GPIO_Init_Tx_Rx);

	 __NOP();


	/* Enable USART2 clock on APB1 bus */
	 __HAL_RCC_USART2_CLK_ENABLE();

	 huart2.Instance = USART2;
	 huart2.Init.BaudRate = 19200; //19200 bit / segundo, para 8N1 serían aprox 1920 bytes / s (Ya que es formato 8N1 son 1 Start, 8 Datos y 1 Stop (10 Bit)
	 huart2.Init.Mode = USART_MODE_TX_RX; //Modo transmisión (Tx) y recepcion (Rx)
	 huart2.Init.Parity = USART_PARITY_NONE;
	 huart2.Init.StopBits = USART_STOPBITS_1; //1 bit de parada
	 huart2.Init.WordLength = USART_WORDLENGTH_8B; //8N1

	 //Cargando la configuracion en los registros FSR del MCU
	 HAL_UART_Init(&huart2);
	 //Registrar la interrupcion en el NVIC para la recepcion Rx
	 HAL_NVIC_EnableIRQ(USART2_IRQn);

	 //Iniciando la Recepcion
	 HAL_UART_Receive_IT(&huart2, &rx_data, 1); //Guardará el dato en rx_data de a 1 byte

}


//Configurando el ADC Init
static void adc_Init(void){
		/* Enable GPIOA clock on AHB1 bus */
		 __HAL_RCC_GPIOA_CLK_ENABLE();

		 GPIO_InitTypeDef GPIO_Init_adc_ch6 = {0};

		 GPIO_Init_adc_ch6.Pin = GPIO_PIN_6;
		 GPIO_Init_adc_ch6.Mode = GPIO_MODE_ANALOG; //Modo de trabajo del pin Analogo
		 GPIO_Init_adc_ch6.Pull = GPIO_NOPULL; //No Pull UP ni Pull Down que alteren el nivel de voltaje que se están leyendo con el ADC


		 //Cargar la configuracion en los registros FSR del MCU
		 HAL_GPIO_Init(GPIOA, &GPIO_Init_adc_ch6);

		 __NOP();

		 /* Enable ADC clock on APB1 bus*/
		 __HAL_RCC_ADC1_CLK_ENABLE();

		 //Configurando la parte general del ADC

		 hadc1.Instance = ADC1;
		 hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV2; //16 MHz / 2 = trabaja a 8 MHz
		 hadc1.Init.Resolution = ADC_RESOLUTION_12B; //Resolucion de 12 bit (4096 divisiones)
		 hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
		 hadc1.Init.ScanConvMode = DISABLE; //Desabilitado el modo escaneo ya que solo se usa un canal del ADC
		 hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV; //Se hace unicamente una conversión porque solo hay un Canal, hace la conversion y la entrega
		 hadc1.Init.ContinuousConvMode = DISABLE; //Unicamente se hará conversion por medio del TRGO
		 hadc1.Init.NbrOfConversion = 1; //Solo hay un canal por lo que solo se requiere una conversion
		 hadc1.Init.DiscontinuousConvMode = DISABLE;
		 hadc1.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T3_TRGO; //Utilizamos el TRGO del tim3 como trigger para la conversión
		 hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING; //Se lanza un ADC cada que detecte flanco de subida del tim3 con TRGO
		 hadc1.Init.DMAContinuousRequests = DISABLE;

		 //CArgar la configuracion en los registros FSR del MCU
		 HAL_ADC_Init(&hadc1);

		 //Configuracion y seleccion del canal especifico
		 ADC_ChannelConfTypeDef adc_ch6 = {0};

		 adc_ch6.Channel = ADC_CHANNEL_6;
		 adc_ch6.Rank = 1; //Orden de la secuencia, como solo hay 1 canal este tiene prioridad
		 adc_ch6.SamplingTime = ADC_SAMPLETIME_56CYCLES; //Ciclos que pasarán para que el condensador se cargue con la señal
		 adc_ch6.Offset = 0;

		 //Cargar la configuracion en los registros FSR del MCU
		 HAL_ADC_ConfigChannel(&hadc1, &adc_ch6);

		 //Registrar la interrupcion en el NVIC
		 HAL_NVIC_EnableIRQ(ADC_IRQn);

		 HAL_ADC_Start_IT(&hadc1); //Iiniciando el ADC1


}

/* Configuración del TIM3 para el TRGO del ADC1 */
static void tim3_adc_Init(void){

	__HAL_RCC_TIM3_CLK_ENABLE(); //Habilitando la señal de reloj para el TIM3 -> APB1

	htim3.Instance = TIM3;

	htim3.Init.Prescaler = 15999; //16 MHz / 16 kHz = 1 kHz (1 ms)
	htim3.Init.CounterMode = TIM_COUNTERMODE_UP; //Conteo en modo ascendente
	htim3.Init.Period = 29; //Periodo de 1 ms * 30 = 30 ms (30 conteos para que CNT  ARR se iguales y CNT vuelva a 0)
	htim3.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1; //NO se hacen divisiones adicionales del reloj TIM3
	htim3.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;

	//Cargando la configuracion en los registros FSR del MCU
	HAL_TIM_Base_Init(&htim3);

	//Configurando el TRGO del TIM3 para interactuar con el ADC1
	TIM_MasterConfigTypeDef confTRGO = {0}; //Master genera eventos como el TRGO y slave responde a ellos (ADC1)

	confTRGO.MasterOutputTrigger = TIM_TRGO_UPDATE; //Cada que ocurra un evento de actualizacion, cada 30 ms
	confTRGO.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;

	//Cargando la configuracion en los registros FSR del MCU para la sincronización del TRGO generado por UPdate Event para hacer la conversion ADC
	HAL_TIMEx_MasterConfigSynchronization(&htim3, &confTRGO);

	//Iniciando el TIM4
	HAL_TIM_Base_Start(&htim3);

}
/*
 * tim4_Init
 * Configures TIM4 to generate an update event every 250 ms
 *
 * Clock chain:
 *   HSI (16 MHz) → APB1 (16 MHz) → TIM3 clock (16 MHz)
 *
 * PSC = 15999  →  tick = 16,000,000 / (15999 + 1) = 1,000 Hz  (1 ms per tick)
 * ARR = 249    →  period = (249 + 1) x 1 ms = 250 ms
 */
static void tim4_Init(void)
{
    /* Enable TIM4 clock on APB1 bus */
    __HAL_RCC_TIM4_CLK_ENABLE();

    /* Configure TIM4 base */
    htim4.Instance               = TIM4;
    htim4.Init.Prescaler         = 15999;
    htim4.Init.CounterMode       = TIM_COUNTERMODE_UP;
    htim4.Init.Period            = 249;
    htim4.Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
    htim4.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    HAL_TIM_Base_Init(&htim4); //Cargando la configuracion en los registros FSR del MCU

    /* Enable TIM4 interrupt line in the NVIC */
    HAL_NVIC_EnableIRQ(TIM4_IRQn);

    /* Start TIM3 in interrupt mode — enables the update event interrupt */
    HAL_TIM_Base_Start_IT(&htim4);
    __NOP();

