mibedoyag/stm32-course-mibedoyag/tallerv-project-telescopemount/Src/Tarea3_TallerV_MABG.c
}


/* Configuración del MCO2 en PC9 para la lectura del Clock del MCU (16 MHz) */
static void mco2_Init(void){

	__HAL_RCC_GPIOC_CLK_ENABLE(); //Activando la señal de reloj para el GPIOC

	GPIO_InitTypeDef mco2_Init = {0};

	mco2_Init.Pin = GPIO_PIN_9;
	mco2_Init.Mode = GPIO_MODE_AF_PP; //Modo funcion alternativa
	mco2_Init.Pull = GPIO_NOPULL; //No pull up ni pull down ya que el pin será salida
	mco2_Init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	mco2_Init.Alternate = GPIO_AF0_MCO; //Funcion alternativa AF00 del MCO2

	//Cargando la configuración a los registros FSR del MCU
	HAL_GPIO_Init(GPIOC, &mco2_Init);

	//Iniciando el MCO
	HAL_RCC_MCOConfig(RCC_MCO2, RCC_MCO2SOURCE_SYSCLK, RCC_MCODIV_1); //1. Usar la salida del MCO2 (PC9), 2. El reloj que sacará por este pin será el principal del sistema(SYSCLK)

}



/*
 * HAL_TIM_PeriodElapsedCallback
 * Called automatically by HAL_TIM_IRQHandler() every time a timer
 * update event fires. Shared by all timers — always check htim->Instance.
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    if (htim->Instance == TIM4)
    {
        HAL_GPIO_TogglePin(GPIOH, GPIO_PIN_1);

    }
}

//Callback de la conversion ADC
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
	if (hadc->Instance == ADC1){
		//Cargando  el dato de la conversion en una variable
		raw_adc = hadc->Instance->DR;
		adc_done = 1;
	}
}

//Callback de la ISR generada por el USART2 Rx
void HAL_UART_RxCpltCallback(UART_HandleTypeDef* huart){
	if (huart->Instance == USART2){

		usart_done = 1;
	}
}





